HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/DataProcessors/ДБ_РабочееМестоПреподавателя/ДБ_РабочееМестоПреподавателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДБ_РабочееМестоПреподавателя</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Ученик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расписание</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ученик</name>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗанятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/InformationRegisters/ДБ_ПланыЗанятий/ДБ_ПланыЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДБ_ПланыЗанятий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УченикГруппа</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/DataProcessors/ДБ_РабочееМестоПреподавателя/Forms/ФормаДобавленияЗанятия/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ученик", Ученик) Тогда
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗанятие(Команда)
	ДобавитьЗанятиеНаСервере();
	Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗанятиеНаСервере() 
	ЗаписьПланЗанятий = РегистрыСведений.ДБ_ПланыЗанятий.СоздатьМенеджерЗаписи();
	ЗаписьПланЗанятий.Период = ТекущаяДатаСеанса();
	ЗаписьПланЗанятий.УченикГруппа = Ученик;
	ЗаписьПланЗанятий.ДатаЗанятия = ДатаЗанятия;
	ЗаписьПланЗанятий.КоличествоЧасов = КоличествоАкадемическихЧасов;
	ЗаписьПланЗанятий.ВремяПроведения = ДБ_РаботаСКалендарем.ПреобразоватьАкадемическиеЧасыВАстрономические(ЗаписьПланЗанятий.КоличествоЧасов);
	ЗаписьПланЗанятий.ДатаНачала = ДатаЗанятия;
	ЗаписьПланЗанятий.ДатаОкончания = ЗаписьПланЗанятий.ДатаНачала + (ЗаписьПланЗанятий.ВремяПроведения - Дата(1, 1, 1));
	ЗаписьПланЗанятий.Записать();
	Событие = Новый Структура;
	Событие.Вставить("Заголовок", "" + Ученик);
	Событие.Вставить("ДатаНачала", ДБ_РаботаСКалендарем.ПреобразоватьДатуВФорматКалендаря(ЗаписьПланЗанятий.ДатаНачала));
	Событие.Вставить("ДатаОкончания", ДБ_РаботаСКалендарем.ПреобразоватьДатуВФорматКалендаря(ЗаписьПланЗанятий.ДатаОкончания));
	ЗаписьПланЗанятий.Идентификатор = ДБ_РаботаСКалендарем.ДобавитьСобытие(Событие);
	ЗаписьПланЗанятий.Записать();
КонецПроцедуры

#КонецОбласти
